# Description:
#   Joke commands.
#
# Commands:
#   ぬるぽ - You reply with, "ｶﾞｯ" When you post a "ぬるぽ" word.
#
# Notes:
#   ネタ/ジョーク系のbot全般

module.exports = (robot) ->
  robot.hear /オエ/i, (msg) ->
    msg.send msg.random [ """
```
　　 ／￣￣＼　ﾑｼｬﾑｼｬ
　　/　 ●/￣￣＼
　 /　　　ﾄ、　　＼
　彳　　　＼＼　　｜
`／　　　/⌒ヽヽ　｜
/　　　 ｜　 | |　/.
　　　　｜ 　ヽ|／∴
　　　　　　　　 ﾟ

オエーー!!!!　＿＿_
　　　 ＿＿_／　　 ヽ
　　 ／　 ／　／⌒ヽ|
　　/ (ﾟ)/　／ /
　 /　　 ﾄ､/｡⌒ヽ。
　彳　　 ＼＼ﾟ｡∴｡ｏ
`／　　　　＼＼｡ﾟ｡ｏ
/　　　　 /⌒＼Ｕ∴)
　　　　 ｜　　ﾞＵ｜
　　　　 ｜　　　||
　　　　　　　　 Ｕ
```
  """
"""
```
　　　　　　三 こ駄 三
　　　　　　三 ら目 三
　　　　　　三 えだ 三
　　　　　　三 るま 三
　　　　　　三 んだ 三
　　　　　　三 だ吐 三
　　　　　　三　 く 三
　　　　　　三　 な 三
　　　　　　　三三三
　:／￣￣＼ヾ
.:/ﾉ( (ﾟｯ)/￣￣＼ヾ
:/ ⌒　　 ﾄ、　　＼゜
彳　 (　 ｡∴＼　　｜∴
/　　　゜　|ヽヽ　｜｡o
　⌒　　　ノ | |　/
　　　　／　 ヽ|／Ｕ
　　　　　　ｕ
```
  """
"""
```
　　 ／￣￣＼
　　/　 ●/￣￣＼
　 /　　　ﾄ、　　＼
　彳　　 ｡∴＼　　｜
`／　　゜/⌒ヽヽ　｜
/　　　 ｜　 | |　/
　　　　｜ 　ヽ|／
　　　ゴクンッ


　　 ／￣￣＼ヾ
　　/　 ◯/￣￣＼ヾ
　 /　　　ﾄ、　　＼゜
　彳　　 ｡∴＼　　｜∴
`／　　゜/⌒ヽヽ　｜｡o
/　　　 ｜　 | |　/
　　　　｜ 　ヽ|／Ｕ
　　　　　　ｕ
```
  """
"""
```
ふむふむ、なるほど

　_＿　／￣￣＼
`/))))/　ー /￣￣＼
｜|||| _　　ﾄ、　　＼
｜||||(｜　 ＼＼　　｜
｜　 ノ｜　/⌒ヽヽ　｜
∧　(　ﾉ　｜　 | |　/
　＼_／　 ｜ 　ヽ|／
　 ／

オエーー!!!! 　＿＿_
　　　　＿＿_／　　 ヽ
　_＿ ／　 ／　／⌒ヽ|
`/)))) (ﾟ)/　／ /
｜|||| _　ﾄ､/｡⌒ヽ。
｜||||(｜ ＼＼ﾟ｡∴｡ｏ
｜　 ノ｜　 ＼＼｡ﾟ｡ｏ
∧　(　ﾉ　 /⌒＼Ｕ∴)
　＼_／　 ｜　　ﾞＵ｜
　 ／ 　　｜　　　||
　　　　　　　　　Ｕ
```
  """
"""
```
オエーー!!!!　＿＿_
　　　 ＿＿_／　　 ヽ
　　 ／　 ／　／⌒ヽ|
　　/ (ﾟ)/　／ /
　 /　　 ﾄ､/｡⌒ヽ。
　彳　　 ＼＼ﾟ｡∴｡ｏ
`／　　　　＼＼｡ﾟ｡ｏ
/　　　　 /⌒＼Ｕ∴)
　　　　 ｜　　ﾞＵ｜
　　　　 ｜　 ∴｡||
ゴクゴク! ＿ ｡Ｕ Ｕ
　　　　／／ Ｕ｡Ｕ|｡
　　　 ｜｜　ｏ∴｡∴
　　　 ｜ Ｖ∴ ｡Ｕ|。
　　　 ∧　ＶＵ｡∴|ｏ
　　　/　＼ Ｖ∴｡Ｕノ|
　　 ｜ (ﾟ)Ｙ￣￣￣ ノ
　　 ｜　　 ￣￣￣厂
　　　＼　　　　 /
　　　 /　　　　｜
```
  """
"""
```
正面
　　　 ＿＿＿
　　 ／ ＿＿ ＼
　　●／ ‥ ＼●
　 ｜｜　　　｜｜
　 彡｜　　　｜ミ
　 ｜∧　　　/ ｜
　 /　 ＼＿／　/
`／　　　　　／
/　　　　　 /
```
  """
"""
```
　　 ／￣￣＼
　　/　 ●/￣￣＼
　 /　　　ﾄ、　　＼
　彳　　　＼＼　　｜
`／　　　/⌒ヽヽ　｜
丿　　　｜　 | |　/
|　　　 ｜ 　ヽ|／
|＿＿＿_/　　　　ﾁｬﾘｰﾝ
　 ||　 ＿＿　|ヽ|ヽ
　_||_ ｜|Θ|(　　 ）
|￣Ｔ￣|L|＿|と　　|
|＿⊥＿| L|　 しーＪ


オエーー!!!!　＿＿_
　　　 ＿＿_／　　 ヽ
　　 ／　 ／　／⌒ヽ|
　　/ (ﾟ)/　／ /
　 /　　 ﾄ､/｡⌒ヽ。
　彳　　 ＼＼ﾟ｡∴｡ｏ
`／　　　　＼＼｡ﾟ｡ｏ
丿　　　　/⌒＼Ｕ∴)
|　　　　｜　　ﾞ||｜
|＿＿＿＿/　　　Ｕ|
　 ||　 ＿＿　|ヽＵ
　_||_ ｜|Θ|(　ﾟ∵）
|￣Ｔ￣|L|＿|と　　|
|＿⊥＿| L|　 しーＪ
```
  """]